StoveSim/simulations/case_50/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    primary_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.08; //changed this to match fuel condition for GRI
        value           uniform 1;
    }
    secondary_air_RHS
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 1;
    }
    secondary_air_LHS
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 1;
    }
    outlet_LHS
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
	outlet_RHS
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    stove_body
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
